Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །དྲན་པ་དག་པ་ཞེས་བྱ་བའི་ཐོས་པའི་གཟུངས་ཀྱང་ཐོབ་སྟེ།
en: They achieved the dhāraṇī of hearing called pure recollection

source: ཐོས་པའི་གཟུངས་དེས་ན་སངས་རྒྱས་བརྒྱས་གསུངས་པའི་ཡང་དག་པར་འཛིན་པར་བྱེད་དོ།
en: With this dhāraṇī of hearing, they became the true holders of the speech of hundreds of buddhas.

source: །གཞོན་ནུ་དེ་དག་དང་དེ་དག་གི་མ་དེ་རྣམས་ཀྱིས་ཀྱང་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་བོ།
en: The young ones and their mothers reached the acceptance of phenomena concurring with reality.

source: །བཙུན་མོ་དེ་དག་གི་ནང་ནས་ཀྱང་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Eighty-four thousand of the queens developed the mind set on awakening.

source: །བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ནི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Eighty-four thousand women reached acceptance.

source: །ལྷ་དང་མི་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ལྷ་དང་མི་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Nine trillion gods and men developed the mind set on awakening.

source: །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པའོ།
en: Three trillion two hundred billion practitioners of the hearer vehicle purified the Dharma eye that beholds phenomena.

source: །དགེ་སློང་ཁྲི་དྲུག་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: Sixty million monks liberated their minds from defilements without perpetuation.

source: །རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་ཡང་རྒྱལ་སྲིད་ཐམས་ཅད་སྤངས་ནས་ལྷ་དང་མིའི་འདོད་པ་རྣམས་ལ་དོན་དུ་གཉེར་བ་མེད་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཉིད་ལ་རྟེན་བཅས་ཏེ།
en: Abandoning his kingdom, with no interest in the normal desires of gods and humans, King Inexhaustible Merit instead pursued unsurpassed and perfect awakening.

source: དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་།
en: Motivated by his faith, he went forth into the homeless life.

source: །རབ་ཏུ་བྱུང་བ་དེ་ཐོས་ནས་རྒྱལ་པོ་དེའི་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བྱུང་ངོ་།
en: Hearing that he had gone forth, all his princes also went forth.

source: །དེ་དག་ཀྱང་རབ་ཏུ་བྱུང་བར་ཤེས་ནས་ཡུལ་གྱི་མི་དང་འཁོར་དྲུག་འབུམ་རབ་ཏུ་བྱུང་ངོ་།
en: Hearing that they had gone forth, the people of the realm and the six hundred thousand members of his retinue also went forth.

source: །རྒྱལ་པོའི་བཙུན་མོའི་ནང་ནས་ཀྱང་བཙུན་མོ་དམ་པ་བཞི་རབ་ཏུ་བྱུང་སྟེ།
en: The four most sublime queens of the king’s harem also went forth.

source: ཀླུའི་རྒྱལ་པོ་དེ་ལྟར་ན་དག་པའི་སེམས་ཅན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་རྣམས་ཀྱི་གནས་སུ་གྱུར་པའི་གསུང་རབ་དེ་དག་དགའ་དགའ་ལྟར་འདུག་པར་གྱུར་ཏོ།
en: “Nāga King, these purified beings who had developed roots of virtue in this manner now lived in constant enthusiasm for those teachings.

source: །ཀླུའི་བདག་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་ཁྱོད་སོམ་ཉི་འམ་ཡིད་གཉིས་སམ་ཐེ་ཚོམ་ཟ་བར་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Nāga Lord, if you are assuming that the universal monarch Inexhaustible Merit of that time was someone else, if you are skeptical, critical, or doubtful about this, do not be.

source: ཀླུའི་རྒྱལ་པོ་དེའི་ཚེ་དེའི་དུས་ན་ཁྱོད་ཉིད་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Because, Nāga King, you are the one who was the universal monarch Inexhaustible Merit at that time.

source: །ཀླུའི་བདག་པོ་ཁྱོད་རྒྱལ་པོའི་བུ་དང་རྒྱལ་པོའི་བུའི་མི་དེ་དག་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Nāga Lord, if you are assuming that you do not know the people who were those princes and princesses, do not think this way.

source: འཁོར་འདིར་འདུས་ཤིང་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ཉིད་ཡིན་ནོ།
en: Because they were precisely these bodhisattva great beings gathered here in this assembly.

source: །ཀླུའི་བདག་པོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Nāga Lord, what do you think?

source: རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་གང་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་དེས་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེ་ལ་བསྟན་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you think that the jeweled casket dhāraṇī that the Thus-Gone One Divine King of Brahmā’s Splendor taught to King Inexhaustible Merit is something unknown to you, do not think this way.

source: མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཉིད་དེའི་ཚེ་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ཅེས་བྱའོ།
en: Because the inexhaustible casket dhāraṇī was at that time known as the jeweled casket

source: །ཀླུའི་བདག་པོ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ནི་སངས་རྒྱས་ཀྱི་སྤྱན་ཆགས་པ་མེད་པས་རྣམ་པར་གཟིགས་ནས་སེམས་ཅན་རྣམས་ལ་སྔོན་གྱི་རྒྱུ་ལས་བྱུང་བའི་ཆོས་ཀྱི་གཏམ་བརྗོད་པ་མཛད་དོ།
en: “In this way, Nāga Lord, the Thus-Gone One sees with unobstructed buddha eyes, and thus he teaches to beings a Dharma that arises from earlier causes.

source: །ཀླུའི་བདག་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མང་པོ་ལས་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཐོས་སོ།
en: Nāga Lord, you have heard this inexhaustible casket dhāraṇī from many thus-gone ones.

source: །ཁྱོད་ཀྱིས་སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་ལས་གཟུངས་འདིའི་དོན་ཡང་དང་ཡང་དུ་ཐོས་ཏེ།
en: You have repeatedly heard the meaning of this dhāraṇī from many hundreds of thousands of buddhas.

source: དེས་ན་ད་ལྟར་ཁྱོད་འདི་ལྟར་དྲན་པ་དང་ལྡན་པ་དང་། འདི་ལྟར་བློ་གྲོས་དང་ལྡན་པ་དང་། འདི་ལྟར་རྟོགས་པ་དང་ལྡན་པ་དང་། འདི་ལྟར་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། འདི་ལྟར་ཤེས་རབ་དང་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན་ནོ།
en: This is why you presently have such recollection, intelligence, realization, abundant eloquence, insight, and wisdom.

source: །ཀླུའི་བདག་པོ་གང་དག་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདིའི་མིང་ཙམ་འམ། བསྟན་པའི་ཕྱོགས་ཙམ་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྤོབས་པ་མི་ཟད་པར་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: Nāga Lord, all who merely hear the name of this inexhaustible casket dhāraṇī or hear it introduced will definitely attain inexhaustible eloquence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུངས་འདིའི་རྒྱུ་དང་འཐུན་པ་ནི་དེ་ཡིན་པའི་ཕྱིར་རོ།
en: Because it accords with the cause that is this dhāraṇī.

source: །ཀླུའི་བདག་པོ་གཟུངས་ཀྱི་ངེས་པར་འབྱུང་བའི་བསྲུང་བ་འདི་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་སྤྱོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཁོ་ན་ལས་གྱུར་པར་བལྟ་བར་བྱའོ།
en: “Nāga Lord, in future times, whenever anyone practices this dhāraṇī protection spell for renunciation, it should be viewed solely as a result of the blessings of the Thus-Gone One.

source: །ཀླུའི་བདག་པོ་དེ་ལ་གཟུངས་འདི་ནི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་སྒོ་ཡིན་ནོ།
en: Nāga Lord, this dhāraṇī is the doorway to eighty-four thousand collections of Dharma.

source: །སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལ་འཇུག་པ་ཡིན་ནོ།
en: It engages in eighty-four thousand actions.

source: །ཏིང་ངེ་འཛིན་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་རྗེས་སུ་འགྲོ་བ་ཡིན་ནོ།
en: It follows eighty-four thousand absorptions.

source: །གཟུངས་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་རྩ་བ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཉིད་ཡིན་ནོ།
en: This inexhaustible casket dhāraṇī is the root of eighty-four thousand types of dhāraṇī.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔས་ཕྱོགས་བཅུར་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པར་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིས་ཆོས་ཀྱི་ཆར་ཆེན་པོ་རབ་ཏུ་འབེབས་པ་གང་ཡིན་པ་དེ་ཡང་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འབའ་ཞིག་གི་རྒྱུ་དང་འཐུན་པ་ལས་གྱུར་པ་ཡིན་ནོ།
en: Nāga Lord, the great rain of Dharma that the bodhisattvas shower without obstruction or impediment throughout the ten directions by means of the four correct discriminations comes from a cause that accords with the inexhaustible casket dhāraṇī.

source: །ཀླུའི་བདག་པོ་དེ་ལ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ལ་འཇུག་པའི་ཚིག་རྣམས་དང་། མཚམས་སྦྱོར་བའི་ཚིག་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་གི་བསྲུང་བའི་ཚིག་རྣམས་ངས་བསྟན་པར་བྱའོ། །ཏདྱ་ཐཱ། ཧེ་ཏུ་མ་ཏི། ཤཱ་མ་མ་ཏི། པྲ་སཱ་ད་མ་ཏི། ཨུཛྫུ་མ་ཏི། ཨུཏྟྭ་ར་ཎ་མ་ཏི། ཨ་ཀྵ་ཡ་མ་ཏི། ཨ་ནུ་སན་དྷི། ཨུ་ལ་ཀ་མུ་ཁེ། པྲ་བྷ་མུ་ཀ་ཏེ། པྲ་བྷ་ཀེ་ཏུ། པྲ་ཙཱ་ར་ཀེ་ཏུ། སྨྲྀ་ཏི་ཀ་ར་ཎེ། མ་ཏི་བི་ཤོ་དྷ་ནེ། ག་ཏི་པྲ་བེ་ཤེ། ཤཱུ་ར་བ་ལེ། ཏ་མོ་ནུ་ཏེ། སན་དྷ་ར་ཎི། ཨུཏྟྭ་ར་ཎི། ཤཱན་ཏ་མུ་ཁེ། ཤཱན་ཏ་པྲ་བྷེ་ཤེ། ཤཱན་ཏ་ཀླེ་ཤ། བཱ་ས་ན་ཨ་པ་ག་ཏེ། ཀུ་ཤ་ལ་བཱ་ས་ནི། ཨ་ནུ་སན་དྷི། བི་སན་དྷི། བི་ག་ཏེ་སྠི་ཏེ། ཨ་ཝ་སྠི་ཏེ། སྠཱ་ན་ཨ་ནུ་ག་ཏེ། ཨ་བ་སྠཱ་ན་ག་ཏེ། ཨ་བི་སཱ་རེ། ཨ་ཤུ་པྲཛྙེ། པྲཛྙཱ་མཱུ་ལེ། མཱུ་ལ་བ་ཏི། ཤ་ཤི་པྲ་བྷེ། སཱུརྱ་བ་ཏི། ཛྱོ་ཏི་ཥྤ། སུ་བི་མ་ལེ། ཨ་མ་ལེ། སརྦ་ཏ་མོ་བི་ཤོ་དྷ་ནི། བུད་དྷ་ཨ་དྷིཥྛི་ཏེ། སརྦ་དེ་བ་ཏཱ་པ་རི་གྲྀ་ཧཱི་ཏེ། སརྦ་བུད་དྷཱ་ནྃ། སཱསྟྱ་ཡ་ནེ། ཨ་ནུ་ཛྙཱ་ན་བྲཧྨ་ཎཱ། པྲ་ཏིཙྪིཏྟ་ཤ་ཀྲེ་ན། པཱ་ལི་ཏ་ལོ་ཀ་པཱ་ལེ། པ་རི་གྲི་ཧཱི་ཏ། ཨཱརྱ་སཾ་གྲྀ་ཧཱི་ཏ། རྀ་ཥི་བི་གཽ་ཏྲ་ན་ཡུཀྟཱ་ནྃ། མོཀྵ་བུདྡྷཱ་ནཱྃ། སྃ་གྲ་ཧོ་དེ་བ་མ་ནུ་ཥྱཱ་ཎྃ། ནི་གྲ་ཧ་ཀླེ་ཤཱ་ནཱྃ། ནི་རྒྷ་ཏཱ་ནཱྃ། མཱ་རཱ་ཎཱྃ། ཧ་རི་ཥཱ་ཎཱྃ། ནི་གྲ་ཧ། སརྦ་པ་ར་པྲ་བཱ་དཱི་ནཱྃ། ཙོ་ད་ན་ཨ་བི་མཱ་ནི་ཀཱ་ནཱྃ། ཨ་ནུ་པ་ཀྲ་མོ་དྷརྨ་བྷ་ཎ་ཀཱ་ནཱྃ། ཨ་བརྫ་ནཱཾ་པ་རི་ཥ་ད།
en: Nāga Lord, I will now teach the words that engage and connect with the inexhaustible casket dhāraṇī, the words of the protection spell of the gods, nāgas, yakṣas, gandharvas, asuras, and garuḍas:

source: སརྦ་སནྟོ་ཥཱ་ནཱྃ། དྷརྨ་ཀཱ་མཱ་ནཱཾ། བ་རི་རཀྵ་དྷརྨ་ཀོ་ཥ་སྱ། ཨ་ནུ་པཙྪེ་ད་སྟྲི་རཏྣ་བི་ད་ཤ་སྱ། མཻ་ཏྲཱི་སརྦ་སཏྭ་ནཱྃ།
en: Tadyathā | hetumati śāmamati prasādamati ujjumati uttāra­ṇamati akṣaya­mati anusandhi ulkamukhe prabha­mukte prabha­ketu pracāraketu smṛtikaraṇe mativiśodhane gatipraveśe śūravale tamonute sandharaṇi uttāraṇi śānta­mukhe śānta­prabheśe śāntakleśa vāsanāpagate kuśala­vāsani anusandhi visandhi vigatesthite avasthite sthānānugate avasthānagate avisāre aśuprajñe prajñāmūle mūlavati śaśiprabhe sūryavati jyotiṣ­prabhe suvimale amale sarva­tamoviśodhani buddhādhiṣṭhite sarva­devatāparigṛhīte sarva­buddhānāṃ sāstyayane anujñāna­brahmaṇā praticchitta­śakrena pālita­lokapāle parigṛhīta ārya­saṃgṛhīta ṛṣivi­gautra­nayuktānāṃ mokṣa­buddhānāṃ saṃgraho deva­manuṣyāṇāṃ nigraha­kleśānāṃ nirghitānāṃ mārānāṃ hariṣāṇāṃ tirthikānāṃ nigraha sarvapara­pravādīnāṃ coda­nāvimānikānāṃ anupakramo dharma­bhaṇakānāṃ avajrāṇāṃ pariṣada sarva­santoṣānāṃ dharma­kāmānāṃ varirakṣa­dharmakoṣasya anupacchedas­tri­ratna­vidaśasya maitrīsarva­satvānāṃ stutasarva­guṇārthikaiḥ.

source: སྟུ་ཏ་སརྦ་གུ་ཎ་ཨརྠི་ཀཻཿ། །ཀླུའི་བདག་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཀུན་ཏུ་བསྲུང་བ་དང་། ཡོངས་སུ་བསྲུང་བའི་ཚིག་ཡིན་ཏེ།
en: “Nāga Lord, these words protect and guard the inexhaustible casket dhāraṇī.

source: དེ་དག་བརྗོད་ན་ཆོས་སྨྲ་བ་དེས་མི་འཇིགས་པ་སུམ་ཅུ་རྩ་གཉིས་ཐོབ་པར་འགྱུར་ཏེ།
en: If Dharma preachers recite them, they will achieve thirty-two kinds of fearlessness.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: What are these thirty-two kinds of fearlessness?

source: གཞན་ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ཕྱིར་ཐོས་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཚིག་འཁྲུལ་པ་མེད་པའི་ཕྱིར་བསྟན་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཚིག་ཟློས་བུ་མེད་པའི་ཕྱིར་ངེས་པའི་ཚིག་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སྒྲ་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པའི་ཕྱིར་བརྟག་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། བྱིན་གྱི་རླབས་སྟོན་པའི་ཕྱིར་སྤོབས་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། འཛིན་པའི་བློ་དང་ལྡན་པའི་ཕྱིར་དྲན་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། གཞན་གྱི་བློ་གྲོས་ཡང་དག་པར་མགུ་བར་བྱེད་པའི་ཕྱིར་བློ་གྲོས་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སོམ་ཉི་མྱུར་དུ་གཅོད་པའི་ཕྱིར་རྟོགས་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། གཞན་གྱི་ངོར་མི་ལྟ་བའི་ཕྱིར་བློ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཚིག་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་འགྱུར་བའི་ཕྱིར་འཁྲུལ་པ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་ཕྱིར་སྤ་གོང་བ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། བཟོད་པ་ཡོངས་སུ་དག་པའི་ཕྱིར་འཛུམ་པའི་བཞིན་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཡང་དག་པར་དམ་བཅས་པ་ལས་མི་ཉམས་པའི་ཕྱིར་བརྟན་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཀླན་ཀ་མི་ཚོལ་བའི་སེམས་དང་ལྡན་པའི་ཕྱིར་ཚིག་གཟུང་བར་འོས་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། འཁོར་མངོན་པར་མགུ་བར་བྱེད་པའི་ཕྱིར་ཚིག་བཙུན་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོའི་ཆོས་གླེང་བའི་ཕྱིར་ཤེས་རབ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཁེངས་པ་མེད་པའི་ཕྱིར་དཔྱོད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅོད་པའི་ཕྱིར་སེང་གེའི་སྒྲ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པའི་ཕྱིར་སྐུར་བ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཉམས་སུ་ལེན་པ་གཏན་ལ་འབེབས་པའི་ཕྱིར་བསྟན་པ་ཁ་ན་མ་ཐོ་བ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། མཁས་པས་མ་སྨད་པའི་ཕྱིར་སྨད་དུ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། མདོ་སྡེ་དང་མི་འགལ་བའི་ཕྱིར་སྦྱོར་འབྱོར་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། དུས་སུ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་ཡང་དག་པར་སྐུལ་བ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པའི་ཕྱིར་ཕྱིན་ཅི་མ་ལོག་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ལ་འདུད་པའི་ཕྱིར་ང་རྒྱལ་མེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སྔོན་ཐོས་པ་ལེགས་པར་བཟུང་བའི་ཕྱིར་ཚིག་དང་ཡི་གེ་ཟད་མི་ཤེས་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཆོས་ཚད་མེད་པ་རྟོགས་པའི་ཕྱིར་ཐམས་ཅད་ཀྱི་དྲི་བ་སྐབས་འབྱེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། བདག་ཉིད་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཕྱིར་འཁོར་ཐམས་ཅད་མངོན་པར་མགུ་བར་བྱེད་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཞེ་འགྲས་པ་མེད་པའི་སེམས་དང་ལྡན་པའི་ཕྱིར་བྱམས་པ་ཆེན་པོ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་བསྲུང་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཆོས་ཀྱི་རྒྱལ་པོ་བྱེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་སྟེ།
en: They are (1) achieving fearless learning because they genuinely delight others, ( ) achieving fearless teaching because their words are unconfused, (3) achieving fearless communication because their words are not repetitive, (4) achieving fearless inquiry because they understand language accurately, (5) achieving fearless eloquence because they display blessings, (6) achieving fearless recollection because they possess a mind that retains, (7) achieving fearless intelligence because they please others’ intelligence, (8) achieving fearless understanding because they swiftly put doubts to rest, (9) achieving fearless attitude because they do not consider others’ perspectives, (10) achieving fearless lack of confusion because they use words correctly, (11) achieving a fearless lack of artifice because their discipline is pure, (1 ) achieving a fearlessly smiling face because their patience is pure, (13) achieving a fearless steadfastness because their promises are unimpaired, (14) achieving fearless words that are suitable to be heard because they do not seek dispute, (15) achieving fearless and powerful words because they please the assembly, (16) achieving fearless insight because they discuss the profound Dharma, (17) achieving fearless investigation because they are not arrogant, (18) achieving a fearless lion’s roar because they defeat all opposing factions, (19) achieving fearless irreproachability because they teach Dharma without expecting financial remuneration, ( 0) achieving fearlessly virtuous teachings because they can discern what should be practiced, ( 1) achieving fearless blamelessness because they are not reviled by the learned, ( ) achieving the fearless application of sources because they do not contradict the sūtras, ( 3) achieving fearless and proper exhortation because they exhort others in timely ways, ( 4) achieving unmistaken fearlessness because they practice what they preach, ( 5) achieving fearless humility because they bow toward all beings, ( 6) achieving fearless and inexhaustible words and statements because of retaining what they have heard before, ( 7) achieving the fearless ability to answer anyone’s questions because they have realized the immeasurable Dharma, ( 8) achieving the fearless ability to please the entire assembly because they have purified themselves, ( 9) achieving the fearless defeat of māras and obstructors because they know all the afflictions, (30) achieving fearless great love because they have no aggression in their minds, (31) achieving fearless great compassion because they protect all beings, and (3 ) achieving fearless awakened wisdom because they act as Dharma kings.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཉན་པ་དང་། མོས་པ་དང་། སྒྲུབ་པ་ནི་མི་འཇིགས་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: “Therefore, Nāga Lord, bodhisattva great beings that hear about, are inspired toward, and accomplish the inexhaustible casket dhāraṇī will achieve these thirty-two kinds of fearlessness.

source: །མི་འཇིགས་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་རྒྱུན་མ་ཆད་པས་ན། དེས་མཐར་གྱིས་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་ཐོབ་པར་འགྱུར་ཏེ།
en: Because these thirty-two kinds of fearlessness are continuous, they culminate in the attainment of the fourfold fearlessness of the thus-gone ones.

source: མི་འཇིགས་པ་དེ་དག་དང་ལྡན་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྒྲ་སྒྲོགས་སོ།
en: Because they have these types of fearlessness, they proclaim the lion’s roar of the thus-gone ones to the world with its gods.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དྲི་བ་ལུང་བསྟན་པའི་ཕྱིར་ཡང་སྐབས་འབྱེད་དོ།
en: Because they can predict all beings’ questions, they can also discern their situations.

source: །སེམས་ཅན་གྱི་རིས་ན་གང་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་དང་འཐུན་པར་རྒོལ་ནུས་པའམ། དེ་བཞིན་གཤེགས་པའི་ཆོས་གསུང་བ་མཛད་པ་ལ་གཅོད་ནུས་པ་དེ་ལྟ་བུའི་སེམས་ཅན་ནི་གང་ཡང་མེད་དོ།
en: No beings whatsoever of any class will be able to oppose what accords with the Dharma of the Thus-Gone One or put an end to his teaching of the Dharma.

source: །ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ལ་སྦྱར་བར་བྱའོ།
en: Therefore, Nāga Lord, bodhisattvas should apply themselves to the inexhaustible casket dhāraṇī.

source: །ཀླུའི་བདག་པོ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ལ་སྦྱོར་བ་གང་ཞེ་ན།
en: “Nāga Lord, what does it mean to apply oneself to the inexhaustible casket dhāraṇī?

source: གང་ལ་མིག་ཏུ་སྦྱོར་བ་ཡང་མེད། གཟུགས་སུ་སྦྱོར་བ་ཡང་མེད། མིག་གི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དང་། རྣ་བར་སྦྱོར་བ་ཡང་མེད།
en: To apply oneself to this dhāraṇī is to not apply oneself to eye, form, or visual consciousness;

source: སྒྲར་སྦྱོར་བ་ཡང་མེད། རྣ་བའི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དང་། སྣར་སྦྱོར་བ་ཡང་མེད། དྲིར་སྦྱོར་བ་ཡང་མེད།
en: to not apply oneself to ear, sound, or auditory consciousness;

source: སྣའི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དང་། ལྕེར་སྦྱོར་བ་ཡང་མེད། རོར་སྦྱོར་བ་ཡང་མེད།
en: to not apply oneself to nose, scent, or olfactory consciousness;

source: ལྕེའི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དང་། ལུས་སུ་སྦྱོར་བ་ཡང་མེད། རེག་བྱར་སྦྱོར་བ་ཡང་མེད།
en: to not apply oneself to tongue, taste, or gustatory consciousness;

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དང་། ཡིད་དུ་སྦྱོར་བ་ཡང་མེད། ཆོས་སུ་སྦྱོར་བ་ཡང་མེད།
en: to not apply oneself to body, tactile sensations, or corporeal consciousness;

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: and to not apply oneself to mind, mental phenomena, or mental consciousness.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་གང་ལ་གཟུགས་སུ་སྦྱོར་བ་ཡང་མེད། གཟུགས་སྐྱེ་བར་སྦྱོར་བ་ཡང་མེད། གཟུགས་གནས་པར་སྦྱོར་བ་ཡང་མེད། གཟུགས་འགག་པར་སྦྱོར་བ་ཡང་མེད་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Nāga Lord, moreover, to apply oneself to this dhāraṇī is to not apply oneself to form, to not apply oneself to the arising of form, to not apply oneself to the abiding of form, and to not apply oneself to the ceasing of form.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་སྦྱོར་བ་ཡང་མེད།
en: Likewise, to apply oneself to this dhāraṇī is to not apply oneself in the same way to sensation, ideation, and formations.

source: རྣམ་པར་ཤེས་པ་སྐྱེ་བར་སྦྱོར་བ་ཡང་མེད། རྣམ་པར་ཤེས་པ་གནས་པར་སྦྱོར་བ་ཡང་མེད། རྣམ་པར་ཤེས་པ་འགག་པར་སྦྱོར་བ་ཡང་མེད་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, it is to not apply oneself to consciousness, to not apply oneself to the arising of consciousness, to not apply oneself to the abiding of consciousness, and to not apply oneself to the ceasing of consciousness.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་གཟུགས་སྟོང་པ་ཉིད་དུ་སྦྱོར་བ་དང་། གཟུགས་སྟོང་པ་ཉིད་དུ་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the emptiness of form and to apply oneself to the emptiness of form without thought.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དུ་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དུ་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, to apply oneself to this dhāraṇī is to apply oneself to the emptiness of sensation, ideation, formations, and consciousness and to apply oneself to the emptiness of these without thought.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་གཟུགས་མཚན་མ་མེད་པར་སྦྱོར་བ་དང་། གཟུགས་མཚན་མ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to form’s lack of marks and to apply oneself to form’s lack of marks without thought.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་པར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, to apply oneself to this dhāraṇī is to apply oneself to sensation, ideation, formations, and consciousness’ lack of marks and to apply oneself to their absence of marks without thought.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་གཟུགས་སྨོན་པ་མེད་པར་སྦྱོར་བ་དང་། གཟུགས་སྨོན་པ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the wishlessness of form and to apply oneself to the wishlessness of form without thought.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་པར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, to apply oneself to this dhāraṇī is to apply oneself to the wishlessness of sensation, ideation, formations, and consciousness and to apply oneself to the wishlessness of these without thought.

source: །གཟུགས་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་སྦྱོར་བ་དང་། གཟུགས་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “To apply oneself to this dhāraṇī is to apply oneself to unconditioned form and to apply oneself to unconditioned form without thought. Likewise, it is to apply oneself to unconditioned sensation, ideation, formations, and consciousness and to apply oneself to these without thought. “To apply oneself to this dhāraṇī is to apply oneself to unborn and nonoccurring form and to apply oneself to unborn and nonoccurring form without thought.

source: །གཟུགས་མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་སྦྱོར་བ་དང་། གཟུགས་མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, it is to apply oneself to unborn and nonoccurring sensation, ideation, formations, and consciousness and to apply oneself to these as unborn and nonoccurring without thought.

source: །གཟུགས་དབེན་པར་སྦྱོར་བ་དང་། གཟུགས་དབེན་པར་ཡང་རློམ་སེམས་མི་བྱེད་པར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “To apply oneself to this dhāraṇī is to apply oneself to void form and to apply oneself to void form without thought.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་པར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་དབེན་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, it is to apply oneself to void sensation, ideation, formations, and consciousness and to apply oneself to these as void without thought.

source: །གཟུགས་རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་སྦྱོར་བ་དང་། གཟུགས་རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “To apply oneself to this dhāraṇī is to apply oneself to form’s inherent purity and to apply oneself to form’s inherent purity without thought.
